---
kind: property
id: P:Autodesk.Revit.DB.ReferenceArrayArray.IsEmpty
source: html/653cceab-cc67-9ca4-9415-b6778419e460.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.